my_dict = {
    'торт': ['мука, вода, сахар, глазурь, Е561, Е740', 2.32, 8000],
    'пирожное': ['мука, сливки, сахар, Е211, Е212 ', 1.75, 1500],
    'маффин': ['мука, сливки, сахар, сухофрукты', 0.95, 1000 ]}
print(f'Добро пожаловать! Что Вас интересует?\n'
      f'торт - 1\n'
      f'пирожное - 2\n'
      f'маффин - 3\n'
      f'exit - 0')
sum_1 = 0
sum_2 = 0
sum_3 = 0
massa_1 = my_dict['торт'][2]
massa_2 = my_dict['пирожное'][2]
massa_3 = my_dict['маффин'][2]
while True:
    slad_1 = int(input('введите Ваш выбор  (торт-1, пирожное-2, маффин-3, exit-0):  '))
    if slad_1 == 1:
        print('состав - 1, цена за 100гр - 2, кол-во всего - 3, вся информация - 4, перейти к покупке - 5')
        list_1 = int(input('введите Ваш выбор:  '))
        if list_1 == 1:
            print('состав:  ', my_dict['торт'][0])
        elif list_1 == 2:
            print('цена за 100гр:  ',my_dict['торт'][1])
        elif list_1 == 3:
            print(my_dict['торт'][2], 'грамм')
        elif list_1 == 4:
            print(my_dict['торт'])
        elif list_1 == 5:
            que_1 = int(input('введите количество в граммах: '))
            sum_1 += que_1 * my_dict['торт'][1]
            massa_1 -= que_1
        elif list_1 == 0:
            break
    if slad_1 == 2:
        print('состав - 1, цена за 100гр - 2, кол-во всего - 3, вся информация - 4, перейти к покупке - 5')
        list_1 = int(input('введите Ваш выбор:  '))
        if list_1 == 1:
            print('состав:  ',my_dict['пирожное'][0])
        elif list_1 == 2:
            print('цена за 100гр:  ',my_dict['пирожное'][1])
        elif list_1 == 3:
            print(my_dict['пирожное'][2], 'грамм')
        elif list_1 == 4:
            print(my_dict['пирожное'])
        elif list_1 == 5:
            que_1 = int(input('введите количество в граммах: '))
            sum_2 += que_1 * my_dict['пирожное'][1]
            massa_2 -= que_1
        elif list_1 == 0:
            break
    if slad_1 == 3:
        print('состав - 1, цена за 100гр - 2, кол-во всего - 3, вся информация - 4, перейти к покупке - 5')
        list_1 = int(input('введите Ваш выбор:  '))
        if list_1 == 1:
            print('состав:  ',my_dict['маффин'][0])
        elif list_1 == 2:
            print('цена за 100гр:  ',my_dict['маффин'][1])
        elif list_1 == 3:
            print(my_dict['маффин'][2], 'грамм')
        elif list_1 == 4:
            print(my_dict['маффин'])
        elif list_1 == 5:
            que_1 = int(input('введите количество в граммах: '))
            sum_3 += que_1 * my_dict['маффин'][1]
            massa_3 -= que_1
        elif list_1 == 0:
            break
    if slad_1 == 0:
        break
summa_123 = sum_1 + sum_2 + sum_3
print(f'к оплате:\n'
      f'торт - {sum_1 / 100}руб.   осталось - {massa_1}гр.\n'
      f'пирожное - {sum_2 / 100}руб.    осталось - {massa_2}гр.\n'
      f'маффин - {sum_3 / 100}руб.  осталось - {massa_3}гр.\n'
      f'итого к оплате - {summa_123 / 100}руб.   Приятного аппетита!')






